IdeaRS.OpenModel.Parameters.ConnectorGridType
Defines a type of fasteners grid.

IdeaRS.OpenModel.Parameters.ConnectorGridType.Regular
Regular type of grid.

IdeaRS.OpenModel.Parameters.ConnectorGridType.FirstShiftedFull
First row is shifted.

IdeaRS.OpenModel.Parameters.ConnectorGridType.SecondShiftedFull
Second row is shifted

IdeaRS.OpenModel.Parameters.ConnectorGridType.FirstShiftedShort
First row is shifted, second row is short.

IdeaRS.OpenModel.Parameters.ConnectorGridType.SecondShiftedShort
Second row is shifted, first is short.

IdeaRS.OpenModel.Parameters.ConnectorGridType.FirstShifted
First shifted.

IdeaRS.OpenModel.Parameters.ConnectorGridType.SecondShifted
Second shifted.

IdeaRS.OpenModel.Parameters.ConnectorGridType.Full
Rows are full.

IdeaRS.OpenModel.Parameters.ConnectorGridType.Short
Rows are short.